---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.SubwallOfStackedWallDeleted
source: html/303ac2cc-62ab-4f90-fcf2-13d06467dc86.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.SubwallOfStackedWallDeleted Property

This stacked wall will be deleted because a subwall could not be created.

## Syntax (C#)
```csharp
public static FailureDefinitionId SubwallOfStackedWallDeleted { get; }
```